toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
#include <msp430.h>
#include <stdint.h>
#include <stdbool.h>
#include <inttypes.h>
#include <cstddef>
#include <atomic>
#define TaskMSP430
#include "Toastbox/Task.h"
#include "SDCard.h"
#include "ICE.h"
#include "ImgSensor.h"
#include "ImgAutoExposure.h"
#include "Startup.h"
#include "GPIO.h"
#include "Clock.h"
#include "RTC.h"
#include "SPI.h"
#include "WDT.h"
#include "FRAMWriteEn.h"
#include "Util.h"
#include "MSP.h"
#include "GetBits.h"
#include "BusyAssertion.h"
#include "Toastbox/IntState.h"
#include "ImgSD.h"
using namespace GPIO;

static constexpr uint64_t _MCLKFreqHz       = 16000000;
static constexpr uint32_t _XT1FreqHz        = 32768;
static constexpr uint32_t _SysTickPeriodUs  = 512;

[[noreturn]]
static void _Abort(uint16_t domain, uint16_t line);

struct _Pin {
    // Default GPIOs
    using VDD_B_1V8_IMG_EN                  = PortA::Pin<0x0, Option::Output0>;
    using VDD_B_EN                          = PortA::Pin<0x1, Option::Output0>;
    using VDD_B_2V8_IMG_EN                  = PortA::Pin<0x2, Option::Output0>;
    using MOTION_SIGNAL                     = PortA::Pin<0x3, Option::Interrupt01, Option::Resistor0>; // Motion sensor can only pull up, so it requires a pulldown resistor
    using ICE_MSP_SPI_DATA_OUT              = PortA::Pin<0x4>;
    using ICE_MSP_SPI_DATA_IN               = PortA::Pin<0x5>;
    using ICE_MSP_SPI_CLK                   = PortA::Pin<0x6>;
    using XOUT                              = PortA::Pin<0x8>;
    using XIN                               = PortA::Pin<0x9>;
    using VDD_B_SD_EN                       = PortA::Pin<0xB, Option::Output0>;
    using DEBUG_OUT                         = PortA::Pin<0xD, Option::Output0>;
    using HOST_MODE_                        = PortA::Pin<0xE, Option::Input, Option::Resistor0>;
};

// _MotionSignalIV: motion interrupt vector; keep in sync with the pin chosen for MOTION_SIGNAL
constexpr uint16_t _MotionSignalIV = P1IV__P1IFG3;

using _Clock = ClockType<_MCLKFreqHz>;
using _SysTick = WDTType<_MCLKFreqHz, _SysTickPeriodUs>;
using _SPI = SPIType<_MCLKFreqHz, _Pin::ICE_MSP_SPI_CLK, _Pin::ICE_MSP_SPI_DATA_OUT, _Pin::ICE_MSP_SPI_DATA_IN>;

class _MotionTask;
class _SDTask;
class _ImgTask;

static void _Sleep();

static void _SchedulerError(uint16_t line);
static void _ICEError(uint16_t line);
static void _SDError(uint16_t line);
static void _ImgError(uint16_t line);

static void _ImgSetPowerEnabled(bool en);

extern uint8_t _StackMain[];

#warning disable stack guard for production
static constexpr size_t _StackGuardCount = 16;
using _Scheduler = Toastbox::Scheduler<
    _SysTickPeriodUs,                           // T_UsPerTick: microseconds per tick
    Toastbox::IntState::SetInterruptsEnabled,   // T_SetInterruptsEnabled: function to change interrupt state
    _Sleep,                                     // T_Sleep: function to put processor to sleep;
                                                //          invoked when no tasks have work to do
    _SchedulerError,                            // T_Error: function to handle unrecoverable error
    _StackMain,                                 // T_MainStack: main stack pointer (only used to monitor
                                                //              main stack for overflow; unused if T_StackGuardCount==0)
    _StackGuardCount,                           // T_StackGuardCount: number of pointer-sized stack guard elements to use
    _MotionTask,                                // T_Tasks: list of tasks
    _SDTask,
    _ImgTask
>;

using _ICE = ICE<
    _Scheduler,
    _ICEError
>;

// _ImgSensor: image sensor object
// Stored in BAKMEM (RAM that's retained in LPM3.5) so that
// it's maintained during sleep, but reset upon a cold start.
using _ImgSensor = Img::Sensor<
    _Scheduler,             // T_Scheduler
    _ICE,                   // T_ICE
    _ImgError               // T_Error
>;

// _SDCard: SD card object
// Stored in BAKMEM (RAM that's retained in LPM3.5) so that
// it's maintained during sleep, but reset upon a cold start.
using _SDCard = SD::Card<
    _Scheduler,         // T_Scheduler
    _ICE,               // T_ICE
    _SDError,           // T_Error
    1,                  // T_ClkDelaySlow (odd values invert the clock)
    0                   // T_ClkDelayFast (odd values invert the clock)
>;

using _RTCType = RTC::Type<_XT1FreqHz, _Pin::XOUT, _Pin::XIN>;

// _RTC: real time clock
// Stored in BAKMEM (RAM that's retained in LPM3.5) so that
// it's maintained during sleep, but reset upon a cold start.
// 
// _RTC needs to live in the _noinit variant, so that RTC memory
// is never automatically initialized, because we don't want it
// to be reset when we abort.
[[gnu::section(".ram_backup_noinit.main")]]
static _RTCType _RTC;

// _ImgAutoExp: auto exposure algorithm object
// Stored in BAKMEM (RAM that's retained in LPM3.5) so that
// it's maintained during sleep, but reset upon a cold start.
[[gnu::section(".ram_backup.main")]]
static Img::AutoExposure _ImgAutoExp;

// _State: stores MSPApp persistent state, intended to be read/written by outside world
// Stored in 'Information Memory' (FRAM) because it needs to persist indefinitely
[[gnu::section(".fram_info.main")]]
static MSP::State _State;

// _Motion: announces that motion occurred
// atomic because _Motion is modified from the interrupt context
static std::atomic<bool> _Motion = false;

// _BusyCount: counts the number of entities preventing LPM3.5 sleep
static uint8_t _BusyCount = 0;
using _BusyAssertion = BusyAssertionType<_BusyCount>;

struct _SDTask {
//    static void Run() {
//        for (;;) {
//            // wait for on signal
//            
//            if (!_State.rca) {
//                // We haven't successfully enabled the SD card since the battery was connected;
//                // enable the SD card and get the card id / card data.
//                SD::CardId cardId;
//                SD::CardData cardData;
//                _State.rca = _SDCard::Enable(&cardId, &cardData);
//                
//                // If the SD state is valid and the SD card id matches, just init the ring buffers
//                if (_State.sd.valid && !memcmp(&_State.sd.cardId, &cardId, sizeof(cardId))) {
//                    _ImgRingBufInit();
//                
//                // Otherwise, either the SD state isn't valid, or the existing SD card id doesn't
//                // match the current card id. Either way, we need to reset the SD state.
//                } else {
//                    _ResetState(cardId, cardData);
//                }
//            
//            } else {
//                // We've previously enabled the SD card successfully; enable it again
//                _SDCard::Enable();
//            }
//            
//            // wait for off signal or WriteImage signal
//        }
//        
//        
//
//        
//        
//        
//        
//        
//        
//        
//        
//        if (!_State.init)
//        
//        for (;;) {
//            switch (_State) {
//            case _State::Uninit: {
//                // Enable the SD card synchronously because we need the card id / card data
//                SD::CardId cardId;
//                SD::CardData cardData;
//                _RCA = _SDCard::Init(&cardId, &cardData);
//                
//                // If the SD state is valid and the SD card id matches, just init the ring buffers
//                if (_State.sd.valid && !memcmp(&_State.sd.cardId, &cardId, sizeof(cardId))) {
//                    _ImgRingBufInit();
//                
//                // Otherwise, either the SD state isn't valid, or the existing SD card id doesn't
//                // match the current card id. Either way, we need to reset the SD state.
//                } else {
//                    _ResetState(cardId, cardData);
//                }
//                
//                _State = _State::Init;
//                break;
//            }
//            
//            case
//            }
//        }
//        
//        
//    }
    
    
    static void DisableAsync() {
        Wait();
        // Short-circuit if the state didn't change
        if (!_State.enabled) return;
        _Scheduler::Start<_SDTask>([] { _Disable(); });
    }
    
