toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    static void EnableAsync() {
        Wait();
        // Short-circuit if the state didn't change
        if (_State.enabled) return;
        _Scheduler::Start<_SDTask>([] { _Enable(); });
    }
    
    static void WriteImage(uint8_t srcBlock, uint32_t dstBlockIdx) {
        Wait();
        assert(_State.enabled);
        
        _SDCard::WriteImage(*_State.rca, srcBlock, dstBlockIdx);
        _ImgRingBufIncrement();
    }
    
    static void Wait() {
        _Scheduler::Wait<_SDTask>();
    }
    
    // WaitForInit(): wait for the initial SD card initialization, which initializes
    // _State.sd (particularly _State.sd.imgRingBufs), which other entities need
    static void WaitForInit() {
        _Scheduler::Wait<_SDTask>([] { return _State.rca.has_value(); });
    }
    
    
    
    
private:
    static void _Disable() {
        assert(!_State.enabled);
        
        _SetPowerEnabled(false);
        _State.enabled = false;
    }
    
    static void _Enable() {
        assert(_State.enabled);
        
        _SetPowerEnabled(true);
        if (!_State.rca) {
            // We haven't successfully enabled the SD card since the battery was connected;
            // enable the SD card and get the card id / card data.
            SD::CardId cardId;
            SD::CardData cardData;
            _State.rca = _SDCard::Init(&cardId, &cardData);
            
            // If SD state isn't valid, or the existing SD card id doesn't match the current
            // card id, reset the SD state.
            if (!_State.sd.valid || memcmp(&_State.sd.cardId, &cardId, sizeof(cardId))) {
                _StateInit(cardId, cardData);
            
            // Otherwise the SD state is valid and the SD card id matches, so init the ring buffers.
            } else {
                _ImgRingBufInit();
            }
        
        } else {
            // We've previously enabled the SD card successfully since the battery was connected;
            // enable it again
            _SDCard::Init();
        }
        
        _State.enabled = true;
    }
    
//    static void _WriteImage(uint8_t srcBlock, uint32_t dstBlockIdx) {
//        assert(_State.enabled);
//        _SDCard::WriteImage(*_State.rca, srcBlock, dstBlockIdx);
//        _ImgRingBufIncrement();
//    }
    
    
    
    
    
    
//    static void Disable() {
//        
//    }
//    
//    static void Enable() {
//        
//    }
//    
//    static void WriteImage(uint8_t srcBlock, uint32_t dstBlockIdx) {
//        Wait();
//        _State.request = Request{
//            .type = Request::WriteImage,
//            .arg.WriteImage = {
//                .srcBlock = srcBlock,
//                .dstBlockIdx = dstBlockIdx,
//            },
//        };
//    }
//    
//    static void Wait() {
//        _Scheduler::Wait<_SDTask>([] { return !_State.request; });
//    }
    
    // _StateInit(): resets the _State.sd struct
    static void _StateInit(const SD::CardId& cardId, const SD::CardData& cardData) {
        FRAMWriteEn writeEn; // Enable FRAM writing
        
        // Mark the _State as invalid in case we lose power in the middle of modifying it
        _State.sd.valid = false;
        std::atomic_signal_fence(std::memory_order_seq_cst);
        
        // Set .cardId
        {
            _State.sd.cardId = cardId;
        }
        
        // Set .imgCap
        {
            // cardBlockCap: the capacity of the SD card in SD blocks (1 block == 512 bytes)
            const uint32_t cardBlockCap = ((uint32_t)GetBits<69,48>(cardData)+1) * (uint32_t)1024;
            // cardImgCap: the capacity of the SD card in number of images
            const uint32_t cardImgCap = cardBlockCap / ImgSD::ImgBlockCount;
            
            _State.sd.imgCap = cardImgCap;
        }
        
        // Set .imgRingBufs
        {
            _State.sd.imgRingBufs[0] = {};
            _State.sd.imgRingBufs[1] = {};
        }
        
        std::atomic_signal_fence(std::memory_order_seq_cst);
        _State.sd.valid = true;
    }
    
    // _ImgRingBufInit(): find the correct image ring buffer (the one with the greatest id that's valid)
    // and copy it into the other slot so that there are two copies. If neither slot contains a valid ring
    // buffer, reset them both so that they're both empty (and valid).
    static void _ImgRingBufInit() {
        using namespace MSP;
        FRAMWriteEn writeEn; // Enable FRAM writing
        
        MSP::ImgRingBuf& a = _State.sd.imgRingBufs[0];
        MSP::ImgRingBuf& b = _State.sd.imgRingBufs[1];
        const std::optional<int> comp = ImgRingBuf::Compare(a, b);
        if (comp && *comp>0) {
            // a>b (a is newer), so set b=a
            b = a;
        
        } else if (comp && *comp<0) {
            // b>a (b is newer), so set a=b
            a = b;
        
        } else if (!comp) {
            // Both a and b are invalid; reset them both
            a = {};
            b = {};
        }
    }
    
    static void _ImgRingBufIncrement() {
        using namespace MSP;
        FRAMWriteEn writeEn; // Enable FRAM writing
        ImgRingBuf ringBufCopy = _State.sd.imgRingBufs[0];
        
        // Update write index
        ringBufCopy.buf.widx++;
        // Wrap widx
        if (ringBufCopy.buf.widx >= _State.sd.imgCap) ringBufCopy.buf.widx = 0;
        
        // Update read index (if we're currently full)
        if (ringBufCopy.buf.full) {
            ringBufCopy.buf.ridx++;
            // Wrap ridx
            if (ringBufCopy.buf.ridx >= _State.sd.imgCap) ringBufCopy.buf.ridx = 0;
            
            // Update the beginning image id (which only gets incremented if we're full)
            ringBufCopy.buf.idBegin++;
        }
        
        // Update the end image id (the next image id that'll be used)
        ringBufCopy.buf.idEnd++;
        
        if (ringBufCopy.buf.widx == ringBufCopy.buf.ridx) ringBufCopy.buf.full = true;
        
        _State.sd.imgRingBufs[0] = ringBufCopy;
        _State.sd.imgRingBufs[1] = ringBufCopy;
    }
    
