toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    static void _SetPowerEnabled(bool en) {
        // Short-circuit if the pin state hasn't changed, to save us the Sleep()
        if (_Pin::VDD_B_SD_EN::Read() == en) return;
        
        _Pin::VDD_B_SD_EN::Write(en);
        // The TPS22919 takes 1ms for VDD to reach 2.8V (empirically measured)
        _Scheduler::Sleep(_Scheduler::Ms(2));
    }
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{};
    
    // Task stack
    [[gnu::section(".stack._SDTask")]]
    static inline uint8_t Stack[256];
    
//    struct Request {
//        enum {
//            Disable,
//            Enable,
//            WriteImage,
//        } type;
//        
//        union {
//            struct {
//                uint8_t srcBlock = 0;
//                uint32_t dstBlockIdx = 0;
//            } WriteImage;
//        } arg;
//    };
    
    [[gnu::section(".ram_backup.main")]]
    static inline struct {
        std::optional<uint16_t> rca;
        bool enabled = false;
//        std::optional<Request> request;
//        bool init = false;
    } _State;
};

struct _ImgTask {
    // Task options
    static constexpr Toastbox::TaskOptions Options{};
    
    // Task stack
    [[gnu::section(".stack._ImgTask")]]
    static inline uint8_t Stack[128];
};

//class _SD {
//public:
//    static void EnableAsync() {
//        Wait();
//        if (_Enabled) return; // Short-circuit
//        _Enabled = true;
//        
//        // If the SD state is valid, and this is a warm start (therefore we've already
//        // verified the SD card ID), then enable the SD card asynchronously.
//        if (_State.sd.valid && !Startup::ColdStart()) {
//            _Scheduler::Start<_SDTask>([] { _RCA = _SDCard::Enable(); });
//            return;
//        }
//        
//        // Otherwise, enable the SD card synchronously because we need the card id / card data
//        SD::CardId cardId;
//        SD::CardData cardData;
//        _RCA = _SDCard::Enable(&cardId, &cardData);
//        
//        // If the SD state is valid and the SD card id matches, just init the ring buffers
//        if (_State.sd.valid && !memcmp(&_State.sd.cardId, &cardId, sizeof(cardId))) {
//            _ImgRingBufInit();
//        
//        // Otherwise, either the SD state isn't valid, or the existing SD card id doesn't
//        // match the current card id. Either way, we need to reset the SD state.
//        } else {
//            _ResetState(cardId, cardData);
//        }
//    }
//    
//    static void DisableAsync(bool force=false) {
//        Wait();
//        if (!_Enabled && !force) return; // Short-circuit
//        _Enabled = false;
//        
//        _Scheduler::Start<_SDTask>([] { _SDCard::Disable(); });
//    }
//    
//    static void Wait() {
//        _Scheduler::Wait<_SDTask>();
//    }
//    
//    static void WriteImage(uint8_t srcBlock, uint32_t dstBlockIdx) {
//        _SDCard::WriteImage(_RCA, srcBlock, dstBlockIdx);
//    }
//    
//private:
//    static inline bool _Enabled = false;
//    static inline uint16_t _RCA = 0;
//    
//    // _ResetState(): resets the _State.sd struct
//    static void _ResetState(const SD::CardId& cardId, const SD::CardData& cardData) {
//        FRAMWriteEn writeEn; // Enable FRAM writing
//        
//        // Mark the _State as invalid in case we lose power in the middle of modifying it
//        _State.sd.valid = false;
//        std::atomic_signal_fence(std::memory_order_seq_cst);
//        
//        // Set .cardId
//        {
//            _State.sd.cardId = cardId;
//        }
//        
//        // Set .imgCap
//        {
//            // cardBlockCap: the capacity of the SD card in SD blocks (1 block == 512 bytes)
//            const uint32_t cardBlockCap = ((uint32_t)GetBits<69,48>(cardData)+1) * (uint32_t)1024;
//            // cardImgCap: the capacity of the SD card in number of images
//            const uint32_t cardImgCap = cardBlockCap / ImgSD::ImgBlockCount;
//            
//            _State.sd.imgCap = cardImgCap;
//        }
//        
//        // Set .imgRingBufs
//        {
//            _State.sd.imgRingBufs[0] = {};
//            _State.sd.imgRingBufs[1] = {};
//        }
//        
//        std::atomic_signal_fence(std::memory_order_seq_cst);
//        _State.sd.valid = true;
//    }
//    
//    // _ImgRingBufInit(): find the correct image ring buffer (the one with the greatest id that's valid)
//    // and copy it into the other slot so that there are two copies. If neither slot contains a valid ring
//    // buffer, reset them both so that they're both empty (and valid).
//    static void _ImgRingBufInit() {
//        using namespace MSP;
//        FRAMWriteEn writeEn; // Enable FRAM writing
//        
//        MSP::ImgRingBuf& a = _State.sd.imgRingBufs[0];
//        MSP::ImgRingBuf& b = _State.sd.imgRingBufs[1];
//        const std::optional<int> comp = ImgRingBuf::Compare(a, b);
//        if (comp && *comp>0) {
//            // a>b (a is newer), so set b=a
//            b = a;
//        
//        } else if (comp && *comp<0) {
//            // b>a (b is newer), so set a=b
//            a = b;
//        
//        } else if (!comp) {
//            // Both a and b are invalid; reset them both
//            a = {};
//            b = {};
//        }
//    }
//};

class _Img {
public:
    static void EnableAsync() {
        Wait();
        if (_Enabled) return; // Short-circuit
        _Enabled = true;
        
        _Scheduler::Start<_ImgTask>([] {
            // Initialize image sensor
            _ImgSensor::Enable();
            // Set the initial exposure _before_ we enable streaming, so that the very first frame
            // has the correct exposure, so we don't have to skip any frames on the first capture.
            _ImgSensor::SetCoarseIntTime(_ImgAutoExp.integrationTime());
            // Enable image streaming
            _ImgSensor::SetStreamEnabled(true);
        });
    }
    
    static void DisableAsync(bool force=false) {
        Wait();
        if (!_Enabled && !force) return; // Short-circuit
        _Enabled = false;
        
