toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
        _Scheduler::Start<_ImgTask>([] { _ImgSensor::Disable(); });
    }
    
    static void Wait() {
        _Scheduler::Wait<_ImgTask>();
    }
    
private:
    static inline bool _Enabled = false;
};

// MARK: - Motion

static void _ImgCapture() {
    const auto& ringBuf = _State.sd.imgRingBufs[0].buf;
    
//    #warning TODO: remove this cold-start disabling once MSP controls ICE40, since ICE40 will be in a known state when MSP applies power
//    // If this is a cold start, ensure SD/Img are disabled
//    // This is necessary because ICE40 can be in an unknown state when MSP
//    // restarts, because MSP may have aborted, or restarted due to STM
//    // Spy-Bi-Wire debug access
//    if (Startup::ColdStart()) {
//        static bool disabled = false;
//        if (!disabled) {
//            _Img::DisableAsync(true);
//            _SD::DisableAsync(true);
//            _Scheduler::Wait<_ImgTask, _SDTask>();
//            disabled = true;
//        }
//    }
    
    // Asynchronously enable the image sensor
    _ImgTask::EnableAsync();
    
    // Asynchronously enable the SD card
    _SDTask::EnableAsync();
    // Block for the first SD initialization to ensure that _State.sd is initialized
    _SDTask::WaitForInit();
    
    // Wait until the image sensor is ready
    _Img::Wait();
    
    // Try up to `CaptureAttemptCount` times to capture a properly-exposed image
    constexpr uint8_t CaptureAttemptCount = 3;
    uint8_t bestExpBlock = 0;
    uint8_t bestExpScore = 0;
    for (uint8_t i=0; i<CaptureAttemptCount; i++) {
        // skipCount:
        // On the initial capture, we didn't set the exposure, so we don't need to skip any images.
        // On subsequent captures, we did set the exposure before the capture, so we need to skip a single
        // image since the first image after setting the exposure is invalid.
        const uint8_t skipCount = (!i ? 0 : 1);
        
        // expBlock: Store images in the block belonging to the worst-exposed image captured so far
        const uint8_t expBlock = !bestExpBlock;
        
        // Populate the header
        static Img::Header header = {
            .magic          = Img::Header::MagicNumber,
            .version        = Img::Header::Version,
            .imageWidth     = Img::PixelWidth,
            .imageHeight    = Img::PixelHeight,
            .coarseIntTime  = 0,
            .analogGain     = 0,
            .id             = 0,
            .timestamp      = 0,
        };
        
        header.coarseIntTime = _ImgAutoExp.integrationTime();
        header.id = ringBuf.idEnd;
        header.timestamp = _RTC.time();
        
        // Capture an image to RAM
        const _ICE::ImgCaptureStatusResp resp = _ICE::ImgCapture(header, expBlock, skipCount);
        const uint8_t expScore = _ImgAutoExp.update(resp.highlightCount(), resp.shadowCount());
        if (!bestExpScore || (expScore > bestExpScore)) {
            bestExpBlock = expBlock;
            bestExpScore = expScore;
        }
        
        // We're done if we don't have any exposure changes
        if (!_ImgAutoExp.changed()) break;
        
        // Update the exposure
        _ImgSensor::SetCoarseIntTime(_ImgAutoExp.integrationTime());
    }
    
    // Write the best-exposed image to the SD card
    const uint32_t dstBlockIdx = ringBuf.widx * ImgSD::ImgBlockCount;
    _SDTask::WriteImage(bestExpBlock, dstBlockIdx);
}

// MARK: - Interrupts

[[gnu::interrupt(RTC_VECTOR)]]
static void _ISR_RTC() {
    _RTC.isr();
}

[[gnu::interrupt(PORT1_VECTOR)]]
static void _ISR_Port1() {
    // Accessing `P1IV` automatically clears the highest-priority interrupt
    switch (__even_in_range(P1IV, _MotionSignalIV)) {
    case _MotionSignalIV:
        _Motion = true;
        // Wake ourself
        __bic_SR_register_on_exit(LPM3_bits);
        break;
    
    default:
        break;
    }
}

[[gnu::interrupt(WDT_VECTOR)]]
static void _ISR_SysTick() {
    const bool wake = _Scheduler::Tick();
    if (wake) {
        // Wake ourself
        __bic_SR_register_on_exit(LPM3_bits);
    }
}

// MARK: - ICE40

template<>
void _ICE::Transfer(const Msg& msg, Resp* resp) {
    AssertArg((bool)resp == (bool)(msg.type & _ICE::MsgType::Resp));
    
    // Init SPI peripheral
    static bool spiInit = false;
    if (!spiInit) {
        spiInit = true;
        _SPI::Init();
    }
    
    // iceInit: Stored in BAKMEM (RAM that's retained in LPM3.5) so that
    // it's maintained during sleep, but reset upon a cold start.
    [[gnu::section(".ram_backup.main")]]
    static bool iceInit = false;
    
    // Init ICE comms
    if (!iceInit) {
        iceInit = true;
        // Reset ICE comms (by asserting SPI CLK for some length of time)
        _SPI::ICEReset();
        // Init ICE comms
        _ICE::Init();
    }
    
//    // Init ICE40 if we haven't done so yet
//    static bool iceInit = false;
//    if (!iceInit) {
//        // Init SPI/ICE40
//        if (Startup::ColdStart()) {
//            constexpr bool iceReset = true; // Cold start -> reset ICE40 SPI state machine
//            _SPI::Init(iceReset);
//            _ICE::Init(); // Cold start -> init ICE40 to verify that comms are working
//        
//        } else {
//            constexpr bool iceReset = false; // Warm start -> no need to reset ICE40 SPI state machine
//            _SPI::Init(iceReset);
//        }
//    }
    
    _SPI::WriteRead(msg, resp);
}

// MARK: - Power

static void _ImgSetPowerEnabled(bool en) {
    // Short-circuit if the pin state hasn't changed, to save us the Sleep()
    if (_Pin::VDD_B_2V8_IMG_EN::Read()==en &&
        _Pin::VDD_B_1V8_IMG_EN::Read()==en) return;
    
    if (en) {
        _Pin::VDD_B_2V8_IMG_EN::Write(1);
        _Scheduler::Sleep(_Scheduler::Us(100)); // 100us delay needed between power on of VAA (2V8) and VDD_IO (1V8)
        _Pin::VDD_B_1V8_IMG_EN::Write(1);
        
        #warning measure actual delay that we need for the rails to rise
    
    } else {
        // No delay between 2V8/1V8 needed for power down (per AR0330CS datasheet)
        _Pin::VDD_B_1V8_IMG_EN::Write(0);
        _Pin::VDD_B_2V8_IMG_EN::Write(0);
        
        #warning measure actual delay that we need for the rails to fall
    }
}

// MARK: - IntState

inline bool Toastbox::IntState::InterruptsEnabled() {
    return __get_SR_register() & GIE;
}

inline void Toastbox::IntState::SetInterruptsEnabled(bool en) {
    if (en) __bis_SR_register(GIE);
    else    __bic_SR_register(GIE);
}

static void _Sleep() {
    // Put ourself to sleep until an interrupt occurs. This function may or may not return:
    // 
    // - This function returns if an interrupt was already pending and the ISR
    //   wakes us (via `__bic_SR_register_on_exit`). In this case we never enter LPM3.5.
    // 
    // - This function doesn't return if an interrupt wasn't pending and
    //   therefore we enter LPM3.5. The next time we wake will be due to a
    //   reset and execution will start from main().
    
    #warning TODO: re-enable LPM3.5 sleep below
    // If we're currently busy (_BusyCount > 0), enter LPM1 sleep because some tasks are running.
    // If we're not busy (!_BusyCount), enter the deep LPM3.5 sleep, where RAM content is lost.
//    const uint16_t LPMBits = (_BusyCount ? LPM1_bits : LPM3_bits);
    const uint16_t LPMBits = LPM1_bits;
    
    // If we're entering LPM3, disable regulator so we enter LPM3.5 (instead of just LPM3)
    if (LPMBits == LPM3_bits) {
        PMMCTL0_H = PMMPW_H; // Open PMM Registers for write
        PMMCTL0_L |= PMMREGOFF_1_L;
    }
    
    // Atomically enable interrupts and go to sleep
    const bool prevEn = Toastbox::IntState::InterruptsEnabled();
    __bis_SR_register(GIE | LPMBits);
    // If interrupts were disabled previously, disable them again
    if (!prevEn) Toastbox::IntState::SetInterruptsEnabled(false);
}

// MARK: - Tasks

//static void debugSignal() {
//    _Pin::DEBUG_OUT::Init();
////    for (;;) {
//    for (int i=0; i<10; i++) {
//        _Pin::DEBUG_OUT::Write(0);
//        for (volatile int i=0; i<10000; i++);
//        _Pin::DEBUG_OUT::Write(1);
//        for (volatile int i=0; i<10000; i++);
//    }
//}

//class _BusyTimeoutTask {
//public:
//    static void Run() {
//        for (;;) {
////            _Scheduler::Wait<_BusyTimeoutTask>([] { return _Busy.has_value(); });
//            
//            while (_Scheduler::Wait<_BusyTimeoutTask,1000>([] { return (bool)_Busy; })) {
//                _Busy = std::nullopt;
//            }
//            
//            // Asynchronously turn off the image sensor / SD card
//            _Img::DisableAsync();
//            _SD::DisableAsync();
//            
//            // Wait until the image sensor / SD card are off
//            _Img::Wait();
//            _SD::Wait();
//            
////            // Wait to be tickled
////            _Scheduler::Wait<_BusyTimeoutTask>([] { return _Tickled; });
////
////            // Assert that we're busy until we stop getting tickled + 1s
////            _BusyAssertion busy;
////            do {
////                _Tickled = false;
////            } while ();
////
////            // Asynchronously turn off the image sensor / SD card
////            _Img::DisableAsync();
////            _SD::DisableAsync();
////
////            // Wait until the image sensor / SD card are off
////            _Img::Wait();
////            _SD::Wait();
//        }
//        
//        _Scheduler::Yield();
//    }
//    
//    
////    static void Run() {
////        for (;;) {
////            _BusyAssertion busy;
////            while (_Scheduler::Wait<_BusyTimeoutTask,1000>([] { return _Tickled; })) {
////                _Tickled = false;
////            }
////            
////            // Asynchronously turn off the image sensor / SD card
////            _Img::DisableAsync();
////            _SD::DisableAsync();
////            
////            // Wait until the image sensor / SD card are off
////            _Img::Wait();
////            _SD::Wait();
////            
//////            // Wait to be tickled
//////            _Scheduler::Wait<_BusyTimeoutTask>([] { return _Tickled; });
//////
//////            // Assert that we're busy until we stop getting tickled + 1s
//////            _BusyAssertion busy;
//////            do {
//////                _Tickled = false;
//////            } while ();
//////
//////            // Asynchronously turn off the image sensor / SD card
//////            _Img::DisableAsync();
//////            _SD::DisableAsync();
//////
//////            // Wait until the image sensor / SD card are off
//////            _Img::Wait();
//////            _SD::Wait();
////        }
////        
////        _Scheduler::Yield();
////    }
//    
////    static void Stop() {
////        _Scheduler::Stop<_BusyTimeoutTask>();
////    }
//    
//    static void Tickle() {
//        _Busy.emplace();
//    }
//    
//    // Task options
//    static constexpr Toastbox::TaskOptions Options{};
//    
//    // Task stack
//    [[gnu::section(".stack._BusyTimeoutTask")]]
//    static inline uint8_t Stack[128];
//    
//private:
//    static inline std::optional<_BusyAssertion> _Busy;
//};

struct _MotionTask {
    static void Run() {
//        for (;;) {
//            _Pin::VDD_B_EN::Write(1);
//            _Scheduler::Sleep(_Scheduler::Ms(500));
//            
//            _Pin::VDD_B_EN::Write(0);
//            _Scheduler::Sleep(_Scheduler::Ms(500));
//        }
//        
//        _Pin::VDD_B_EN::Write(1);
//        _Scheduler::Sleep(_Scheduler::Ms(500));
//        
//        for (;;) {
//            _Pin::DEBUG_OUT::Write(1);
//            _ICE::Transfer(_ICE::LEDSetMsg(0xFF));
//            _Scheduler::Sleep(_Scheduler::Ms(500));
//            
//            _Pin::DEBUG_OUT::Write(0);
//            _ICE::Transfer(_ICE::LEDSetMsg(0x00));
//            _Scheduler::Sleep(_Scheduler::Ms(500));
//        }
        
