toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    abort.eventsCount++;
}

//[[noreturn]]
//static void _BOR() {
//    // Trigger a BOR
//    PMMCTL0 = PMMPW | PMMSWBOR;
//}

[[noreturn]]
static void _Abort(uint16_t domain, uint16_t line) {
    const MSP::Time timestamp = _RTC.time();
    // Record the abort
    _AbortRecord(timestamp, domain, line);
    // Trigger a BOR
    PMMCTL0 = PMMPW | PMMSWBOR;
    
//    PMMCTL0_H = PMMPW_H; // Open PMM Registers for write
//    PMMCTL0_L |= PMMSWBOR_1_L;
    
    for (;;);
    
//    _Pin::DEBUG_OUT::Init();
//    
//    for (;;) {
//        for (uint16_t i=0; i<(uint16_t)domain; i++) {
//            _Pin::DEBUG_OUT::Write(1);
//            _Pin::DEBUG_OUT::Write(0);
//        }
//        
//        for (volatile int i=0; i<100; i++) {}
//        
//        for (uint16_t i=0; i<(uint16_t)line; i++) {
//            _Pin::DEBUG_OUT::Write(1);
//            _Pin::DEBUG_OUT::Write(0);
//        }
//        
//        for (volatile int i=0; i<1000; i++) {}
//    }
}

extern "C" [[noreturn]]
void abort() {
    _Abort(AbortDomain::General, 0);
}

// MARK: - Main

#warning verify that _StackMainSize is large enough
#define _StackMainSize 128

[[gnu::section(".stack.main")]]
uint8_t _StackMain[_StackMainSize];

asm(".global __stack");
asm(".equ __stack, _StackMain+" Stringify(_StackMainSize));

static void _hostMode() {
    // Let power rails fully discharge before turning them on
    _Scheduler::Delay(_Scheduler::Ms(100));
    
    _Pin::VDD_B_EN::Write(1);
    _Pin::VDD_B_1V8_IMG_EN::Write(1);
    _Pin::VDD_B_2V8_IMG_EN::Write(1);
    _Pin::VDD_B_SD_EN::Write(1);
    
    while (!_Pin::HOST_MODE_::Read()) {
        _Scheduler::Delay(_Scheduler::Ms(100));
    }
    
    _Pin::VDD_B_EN::Write(0);
    _Pin::VDD_B_1V8_IMG_EN::Write(0);
    _Pin::VDD_B_2V8_IMG_EN::Write(0);
    _Pin::VDD_B_SD_EN::Write(0);
}

int main() {
    // Stop watchdog timer
    WDTCTL = WDTPW | WDTHOLD;
    
//    if (Startup::ColdStart()) {
//        
//        // Init GPIOs
//        GPIO::Init<
//            // Main Pins
//            _Pin::HOST_MODE_,
//            
//            // Clock pins (config chosen by _RTCType)
//            _RTCType::Pin::XOUT,
//            _RTCType::Pin::XIN
//            
//    //        _Pin::DEBUG_OUT
//        >();
//        
//        
//        
//        
//        
//        
//        _Pin::HOST_MODE_::Init();
//        _RTCType::Pin::XOUT::Init();
//        _RTCType::Pin::XIN::Init();
//        
//        while (!_Pin::HOST_MODE_::Read()) {
//            _Scheduler::Delay(_Scheduler::Ms(100));
//        }
//        
//        GPIO::Init<
//            _Pin::HOST_MODE_,
//        >();
//        
//        GPIO::Init<_Pin::HOST_MODE_>
//        
//    }
//    
//    if (!_Pin::HOST_MODE_::Read()) {
//        while (!_Pin::HOST_MODE_::Read()) {
//            _Scheduler::Delay(_Scheduler::Ms(100));
//        }
//        _BOR();
//    }
//    
//    // Init RTC
//    // We need RTC to be unconditionally enabled for 2 reasons:
//    //   - We want to track relative time (ie system uptime) even if we don't know the wall time.
//    //   - RTC must be enabled to keep BAKMEM alive when sleeping. If RTC is disabled, we enter
//    //     LPM4.5 when we sleep (instead of LPM3.5), and BAKMEM is lost.
//    const MSP::Time time = _State.time;
//    if (time) {
//        // If `time` is valid, consume it before handing it off to _RTC.
//        FRAMWriteEn writeEn; // Enable FRAM writing
//        // Reset `_State.time` before consuming it, so that if we lose power,
//        // the time won't be reused again
//        _State.time = 0;
//        std::atomic_signal_fence(std::memory_order_seq_cst);
//    }
//    _RTC.init(time);
//    
//    // If this is a cold start, wait until HOST_MODE_ is high.
//    // STM32 controls HOST_MODE_ to control when we start executing, in order to implement mutual
//    // exclusion on controlling the power rails and talking to ICE40.
//    if (Startup::ColdStart()) {
//        _BusyAssertion busy; // Prevent LPM3.5 sleep during the delay
//        while (!_Pin::HOST_MODE_::Read()) {
//            _Scheduler::Delay(_Scheduler::Ms(100));
////            debugSignal();
//        }
//        
////        _Pin::DEBUG_OUT::Init();
////        while (!_Pin::HOST_MODE_::Read()) {
////            _Pin::DEBUG_OUT::Write(1);
////            _Scheduler::Delay(_Scheduler::Ms(50));
////            _Pin::DEBUG_OUT::Write(0);
////            _Scheduler::Delay(_Scheduler::Ms(50));
////        }
//        
//        // Once we're allowed to run, disable the pullup on HOST_MODE_ to prevent the leakage current (~80nA)
//        // through STM32's GPIO that controls HOST_MODE_.
//        using HOST_MODE__PULLDOWN = _Pin::HOST_MODE_::Opts<Option::Input, Option::Resistor0>;
//        HOST_MODE__PULLDOWN::Init();
//    }
    
    
    
//    volatile bool a = false;
//    while (!a);
    
    // Init GPIOs
    GPIO::Init<
        // Main Pins
        _Pin::VDD_B_1V8_IMG_EN,
        _Pin::VDD_B_2V8_IMG_EN,
        _Pin::VDD_B_SD_EN,
        _Pin::VDD_B_EN,
        _Pin::MOTION_SIGNAL,
        _Pin::HOST_MODE_,
        
        // SPI pins (config chosen by _SPI)
        _SPI::Pin::Clk,
        _SPI::Pin::DataOut,
        _SPI::Pin::DataIn,
        
        // Clock pins (config chosen by _RTCType)
        _RTCType::Pin::XOUT,
        _RTCType::Pin::XIN
        
//        _Pin::DEBUG_OUT
    >();
    
    // Init clock
    _Clock::Init();
    
//    debugSignal();
    
    #warning if this is a cold start:
    #warning   wait a few milliseconds to allow our outputs to settle so that our peripherals
    #warning   (SD card, image sensor) fully turn off, because we may have restarted because
    #warning   of an error
    
    #warning we're currently sleeping before we abort -- move that sleep here instead.
    
    #warning how do we handle turning off SD clock after an error occurs?
    #warning   ? dont worry about that because in the final design,
    #warning   well be powering off ICE40 anyway?
    
    // Start RTC if it's not currently enabled.
    // We need RTC to be unconditionally enabled for 2 reasons:
    //   - We want to track relative time (ie system uptime) even if we don't know the wall time.
    //   - RTC must be enabled to keep BAKMEM alive when sleeping. If RTC is disabled, we enter
    //     LPM4.5 when we sleep (instead of LPM3.5), and BAKMEM is lost.
//    const MSP::Time time = _State.time;
//    if (time) {
//        {
//            // If `time` is valid, consume it and hand it off to _RTC.
//            FRAMWriteEn writeEn; // Enable FRAM writing
//            
//            // Reset `_State.time` before consuming it, so that if we lose power,
//            // the time won't be reused again
//            _State.time = 0;
//            std::atomic_signal_fence(std::memory_order_seq_cst);
//        }
//        
//        // Init real-time clock
//        _RTC.init(time);
//    
//    // Otherwise, we don't have a valid time, so if _RTC isn't currently
//    // enabled, init _RTC with 0.
//    } else if (!_RTC.enabled()) {
//        _RTC.init(0);
//    }
    
    // Init RTC
    // We need RTC to be unconditionally enabled for 2 reasons:
    //   - We want to track relative time (ie system uptime) even if we don't know the wall time.
    //   - RTC must be enabled to keep BAKMEM alive when sleeping. If RTC is disabled, we enter
    //     LPM4.5 when we sleep (instead of LPM3.5), and BAKMEM is lost.
    MSP::Time startTime = 0;
    if (_State.startTime.valid) {
        // If `time` is valid, consume it before handing it off to _RTC.
        FRAMWriteEn writeEn; // Enable FRAM writing
        // Reset `valid` before consuming the start time, so that if we lose power,
        // the time won't be reused again
        _State.startTime.valid = false;
        std::atomic_signal_fence(std::memory_order_seq_cst);
    }
    _RTC.init(startTime);
    
    // Init SysTick
    _SysTick::Init();
    
    // Handle cold starts
    if (Startup::ColdStart()) {
        _BusyAssertion busy; // Prevent LPM3.5 sleep during the delay
        
        // Temporarily enable a pullup on HOST_MODE_ so that we can determine whether STM is driving it low.
        // We don't want the pullup to be permanent to prevent leakage current (~80nA) through STM32's GPIO
        // that controls HOST_MODE_.
        using HOST_MODE_PULLUP = _Pin::HOST_MODE_::Opts<Option::Input, Option::Resistor1>;
        HOST_MODE_PULLUP::Init();
        
