toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
        // Wait for pullup to pull rail up
        _Scheduler::Delay(_Scheduler::Ms(1));
        
        // Enter host mode if HOST_MODE_ is asserted
        if (!_Pin::HOST_MODE_::Read()) {
            _hostMode();
        }
        
        _Pin::HOST_MODE_::Init();
        
        // Since this is a cold start, delay 3s before beginning.
        // This delay is meant for the case where we restarted due to an abort, and
        // serves 2 purposes:
        //   1. it rate-limits aborts, in case there's a persistent issue
        //   2. it allows GPIO outputs to settle, so that peripherals fully turn off
        _Scheduler::Delay(_Scheduler::Ms(3000));
    }
    
//    // If this is a cold start, delay 3s before beginning.
//    // This delay is meant for the case where we restarted due to an abort, and
//    // serves 2 purposes:
//    //   1. it rate-limits aborts, in case there's a persistent issue
//    //   2. it allows GPIO outputs to settle, so that peripherals fully turn off
//    if (Startup::ColdStart()) {
////        #warning TODO: VDD_B_EN needs to be controlled elsewhere when we implement proper power rail control
////        // Turn on VDD_B
////        _Pin::VDD_B_EN::Write(1);
//        
//        _BusyAssertion busy; // Prevent LPM3.5 sleep during the delay
//        _Scheduler::Delay(_Scheduler::Ms(3000));
//    }
    
//    debugSignal();
    _Scheduler::Run();
}




//#warning TODO: remove these debug symbols
//#warning TODO: when we remove these, re-enable: Project > Optimization > Place [data/functions] in own section
//constexpr auto& _Debug_Tasks              = _Scheduler::_Tasks;
//constexpr auto& _Debug_DidWork            = _Scheduler::_DidWork;
//constexpr auto& _Debug_CurrentTask        = _Scheduler::_CurrentTask;
//constexpr auto& _Debug_CurrentTime        = _Scheduler::_ISR.CurrentTime;
//constexpr auto& _Debug_Wake               = _Scheduler::_ISR.Wake;
//constexpr auto& _Debug_WakeTime           = _Scheduler::_ISR.WakeTime;
//
//struct _DebugStack {
//    uint16_t stack[_StackGuardCount];
//};
//
//const _DebugStack& _Debug_MainStack               = *(_DebugStack*)_StackMain;
//const _DebugStack& _Debug_MotionTaskStack         = *(_DebugStack*)_MotionTask::Stack;
//const _DebugStack& _Debug_SDTaskStack             = *(_DebugStack*)_SDTask::Stack;
//const _DebugStack& _Debug_ImgTaskStack            = *(_DebugStack*)_ImgTask::Stack;
